import { ArchetypeType } from "./types";

export const archetypes: ArchetypeType[] = [
  {
    id: 1,
    name: "Невинный",
    description:
      "Полезный, благотворный, чистый, честный, всепрощающий, достойный доверия, счастливый, оптимистичный, любит простые удовольствия",
  },
  {
    id: 2,
    name: "Славный малый",
    description:
      "Неброский, прямолинейный, как все, надежный, практичный, приземленный, предсказуемый, статус кво, традиционный",
  },
  {
    id: 3,
    name: "Герой",
    description:
      "Воитель, соревнующийся, агрессивный, победитель, принципиальный, идеалист, отрицает все плохое, стремится улучшить мир, гордый, смелый, отважный",
  },
  {
    id: 4,
    name: "Родитель",
    description:
      "Альтруистический, не думающий о себе, заботливый, сострадательный, сопереживающий, готовы помочь, щедрый, благородный",
  },
  {
    id: 5,
    name: "Искатель",
    description:
      "Исследователь, рискованный, опасный, независимый, самоустремленный, самореализующийся, ценящий свободу",
  },
  {
    id: 6,
    name: "Любовник",
    description:
      "В поисках настоящей любви, интимный, чувствительный, страстный, сексуальный, соблазнительный, ищет наслаждения, баловень, живет эмоциями",
  },
  {
    id: 7,
    name: "Бунтарь",
    description:
      "Мятежный, шокирующий, пробивной, разрушительный, cильный, влиятельный, революционный, освободительны",
  },
  {
    id: 8,
    name: "Творец",
    description:
      "Новатор, фантазер, артистичный, экспериментатор, идет на риск, амбициозный",
  },
  {
    id: 9,
    name: "Правитель",
    description:
      "Управленец, организатор, Квалифицированный, действительный, эффективный, продуктивный, уверенный, ответственный, ролевая модель",
  },
  {
    id: 10,
    name: "Волшебник",
    description:
      "Шаман, целитель, божественный, интуитивный, волшебные моменты и ритуалы, катализатор для изменений, харизма и обаяние",
  },
  {
    id: 11,
    name: "Мудрец",
    description:
      "Мыслитель, философ, задумчивый, эксперт, советник, учитель, самоуверенный, самоконтролируемый, независимый",
  },
  {
    id: 12,
    name: "Шут",
    description:
      "Шутник, клоун, фокусник, игривый, веселый, принимает вещи легко, создает веселье/хаос, импульсивный, спонтанный, живет одним моментом.",
  },
];
